k3d-setup/README.md improved
